{
  "hello-world": "Hello World",
  "Language": "Language",
  "english": "English",
  "italian": "Italian",
  "MyMathSim": "MyMathSim",
  "Rectangular Form": "Rectangular Form",
  "Re": "Re",
  "Im": "Im",
  "Polar Form": "Polar Form",
  "rho": "ρ",
  "omega": "ω",
  "Theta": "θ",
  "Apply Operation": "Apply Operation",
  "Operation": "Operation",
  "Select Operation": "Select Operation",
  "Power": "Power",
  "Nth Root": "Nth Root",
  "n": "n",
  "Home": "Home",
  "Complex Numbers": "Complex Numbers",
  "Interactive visualizations for mathematical concepts": "Interactive visualizations for mathematical concepts",
  "Introduction to complex numbers and their applications.": "Introduction to complex numbers and their applications.",
  "The problem": "The problem",
  "Example": "Example",
  "Playground": "Playground",
  "complex-numbers-problem-1": "You are an engineer hired by AstroSatellites & Co. to study a 2-meter-high antenna that must rotate to always point at the same satellite. Among the various calculations you need to perform, you are naturally interested in knowing the final position of the antenna after a certain rotation. The first idea that comes to mind is to use the following rotation matrix:",
  "complex-numbers-problem-2": "This works, but if we are asked to add tilts or rotations around other axes, the task becomes much more complex. Therefore, we can find a much simpler and immediate solution: complex numbers allow us to identify how far a point is displaced along the X-axis (real part) and the Y-axis (imaginary part), as well as to know the length of a vector (ρ) and its rotation angle (θ). So, let's think of our antenna, viewed from above, as the complex number:",
  "complex-numbers-problem-3": "With this, we can now calculate all the known rotations, and we can consider the task successfully completed!",
  "complex-numbers-fourier-problem-1": "Perfect! The antenna receives the satellite signals correctly, but the received signal is not a simple wave — it is a mix of interference and spikes, and therefore unintelligible.",
  "complex-numbers-fourier-problem-2": "You think about it for a while and realize that a wave is nothing more than a vector that rotates around a center over a time interval t, forming a circle. Considering a wave amplitude A and an angular frequency ω (2πf), our wave can be represented as a complex number using the notation:",
  "complex-numbers-fourier-problem-3": "Therefore, our imprecise wave, being a collection of precise waves that can each be represented as distinct vectors rotating at different speeds around the same center, can itself be interpreted as the sum of all these precise and distinct waves, each representable as a complex number, and thus:",
  "complex-numbers-fourier-problem-4": "Now that we know the received signal is the sum of many elementary waves, we can finally isolate a specific one. The procedure is simple: we compare the signal with a complex rotation that spins exactly at the frequency we are interested in. If that frequency is truly present in the signal, the two rotations align and the result of the integration becomes large (i.e., close to the amplitude value). If it is not present, the rotations cancel each other out and the contribution vanishes. This way we extract only the desired component, separating it from everything else.",
  "complex-numbers-fourier-problem-5": "Let us consider a signal received by the antenna composed of two waves: one with frequency -5 and amplitude 3, and a second one with frequency 12 and amplitude 0.5. We want to verify whether frequency -5 is present in the signal and with what intensity. To do this, we multiply the signal by a complex rotation at frequency -5 and integrate over time.",
  "complex-numbers-fourier-problem-6": "Through integration we obtain the magnitude of the components: C(-5) ≈ 3 indicates that frequency -5 is present and dominant, C(12) ≈ 0.5 shows that frequency 12 is present but weaker, and for all other frequencies C(ω) ≈ 0.",
  "Add": "Add"
}
